const commitlintConfig = {
  extends: ['@commitlint/config-conventional'],
  
  rules: {
    // Тип коммита обязателен
    'type-enum': [
      2,
      'always',
      [
        'feat',     // Новая фича
        'fix',      // Исправление бага
        'docs',     // Изменения в документации
        'style',    // Форматирование, отсутствие изменений в коде (пробелы, точки с запятой)
        'refactor', // Рефакторинг кода (без исправления багов и добавления фич)
        'perf',     // Изменения для улучшения производительности
        'test',     // Добавление или исправление тестов
        'build',    // Изменения в системе сборки или внешних зависимостях
        'ci',       // Изменения в конфигурации CI
        'chore',    // Прочие изменения, не влияющие на src или test файлы
        'revert',   // Откат предыдущего коммита
      ],
    ],
    // Тема коммита не должна быть пустой
    'subject-empty': [2, 'never'],
    // Тема не должна заканчиваться точкой
    'subject-full-stop': [2, 'never', '.'],
  },
};

export default commitlintConfig;
